app/controllers/posts_controller.rb

    def index
        @post = Post.all()
---
SELECT "posts".* FROM "posts"

    def update
        @post = Post.find(params[:id])
        if(@post.update(posts_params))
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "keshav is awesome and cool\r\n"], ["updated_at", "2019-12-21 13:58:52.831623"], ["id", 1]]

    def create
    # here we can just render post param where post is the ID of that form
    # render plain: params[:post].inspect

    # here @ is used to define a variable and it is cool and easy
    # in Post.new(); Post represent the modal and i new we can pass in the params
    # @post = Post.new(params[:post]);
     @post = Post.new(posts_params);

     if(@post.save)
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "keshav"], ["body", "keshav is awesome"], ["created_at", "2019-12-21 10:59:09.075181"], ["updated_at", "2019-12-21 10:59:09.075181"]]